// Kernel.h: interface for the CKernel class.
//
//////////////////////////////////////////////////////////////////////

#if !defined(AFX_KERNEL_H__4DE3314D_CDED_4AD9_8939_50F6F33B535F__INCLUDED_)
#define AFX_KERNEL_H__4DE3314D_CDED_4AD9_8939_50F6F33B535F__INCLUDED_

#if _MSC_VER > 1000
#pragma once
#endif // _MSC_VER > 1000

#include <AfxMt.h>

class CKernel  
{
public:
	CKernel();
	~CKernel();
	//*********************************************************************
	// function : 设置是否在升级内核中
	//*********************************************************************
	void InKernel(BOOL bInKernel);
	//*********************************************************************
	// function : 查询是否在升级内核中
	//*********************************************************************
	BOOL InKernel();
	//*********************************************************************
	// function	: 锁定升级内核状态
	// parameter: bLock TRUE为锁定，FALSE为解锁
	//*********************************************************************
	void LockKernel(BOOL bLock);
	//*********************************************************************
	// function : 重置
	//*********************************************************************
	void Reset();
	//*********************************************************************
	// function : 取消
	//*********************************************************************
	void Cancel();
	//*********************************************************************
	// function : 是否取消
	//*********************************************************************
	BOOL IsCanceled();
private:
	CCriticalSection m_secKernel;
	CCriticalSection m_secCancel;
	BOOL			 m_bInKernel;	// 是否在内核中
	BOOL			 m_bCanceled;	// 是否已经取消
};

#endif // !defined(AFX_KERNEL_H__4DE3314D_CDED_4AD9_8939_50F6F33B535F__INCLUDED_)
